In [26]:
# importing the libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from pathlib import Path as path
import seaborn as sns 

import warnings
warnings.filterwarnings('ignore')

In [27]:
# paths for the directories
home_dir = path.cwd().parent           # home directory
data_dir = home_dir / 'data'           # data directory
iterim_data_dir = data_dir / 'interim' # interim data directory path
dataset_path = iterim_data_dir / "flat-house-dataset_v2.csv"  # dataset path

In [28]:
# loading the dataset into pandas dataframe
df = pd.read_csv(dataset_path)

# checking few rows from the dataset
df.head()

,property_type,society,sector,price,price_per_sqft,area,areaWithType,bedRoom,bathroom,balcony,...,super_built_up_area,built_up_area,carpet_area,servant room,others,pooja room,study room,store room,furnishing_type,luxury_score
0,flat,umang monsoon breeze,sector 78,0.95,5491.0,1730.0,Built Up area: 1730 (160.72 sq.m.),3.0,3,2,...,NaN,1730.00,NaN,0,0,0,0,0,0,65
1,flat,experion the heartsong,sector 108,1.68,8387.0,2003.0,Super Built up area 2003(186.08 sq.m.)Built Up...,3.0,3,3+,...,2003.0,1338.29,986.41,1,0,0,1,0,0,86
2,flat,umang winter hills,sector 77,0.75,5588.0,1342.0,Super Built up area 1342(124.68 sq.m.)Built Up...,2.0,2,2,...,1342.0,1140.00,969.00,0,0,0,0,1,0,102
3,flat,shree vardhman flora,sector 90,0.92,4717.0,1950.0,Carpet area: 1950 (181.16 sq.m.),3.0,3,2,...,NaN,NaN,1950.00,0,0,0,1,0,0,49
4,flat,dlf park place,sector 54,4.85,30180.0,1607.0,Super Built up area 1983(184.23 sq.m.)Built Up...,3.0,4,3+,...,1983.0,1785.00,1607.00,1,0,0,0,0,1,158

In [29]:
# checking the shape of the dataset
print(f"Shape of the dataset: {df.shape}")

Shape of the dataset: (3793, 23)

In [30]:
# taking a brief overview over the dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3793 entries, 0 to 3792
Data columns (total 23 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   property_type        3793 non-null   object
 1   society              3793 non-null   object
 2   sector               3793 non-null   object
 3   price                3775 non-null   float64
 4   price_per_sqft       3775 non-null   float64
 5   area                 3775 non-null   float64
 6   areaWithType         3793 non-null   object
 7   bedRoom              3793 non-null   float64
 8   bathroom             3793 non-null   int64
 9   balcony              3793 non-null   object
 10  floorNum             3776 non-null   float64
 11  facing               2695 non-null   object
 12  agePossession        3793 non-null   object
 13  super_built_up_area  1913 non-null   float64
 14  built_up_area        1731 non-null   float64
 15  carpet_area          1938 non-null   float64
 16  servant room         3793 non-null   int64
 17  others               3793 non-null   int64
 18  pooja room           3793 non-null   int64
 19  study room           3793 non-null   int64
 20  store room           3793 non-null   int64
 21  furnishing_type      3793 non-null   int64
 22  luxury_score         3793 non-null   int64
dtypes: float64(8), int64(8), object(7)
memory usage: 681.7+ KB

In [31]:
# checking for the duplicated rows in the dataset
print(f"Count of the duplicated rows in the dataset: {df.duplicated().sum()}")

Count of the duplicated rows in the dataset: 125

In [32]:
# removing the duplicated rows from the dataset
df.drop_duplicates(inplace=True)

In [33]:
df.sector.value_counts()

sector
sector 2      247
sector 85     108
sector 102    107
sector 92      99
sector 69      93
             ...
sector 73       3
sector 17a      3
sector 17b      3
sector 27       3
sector 37       1
Name: count, Length: 106, dtype: int64